"use client";
import styles from "@/app/privacy_policy/page.module.css";
import Link from "next/link";


export default function Privacy() {
   

  
  return (
    <div className={styles.contacts_wrapper}>
        <div className={styles.contacts_container}>
          <div className={styles.contacts_header}>
            <h1>Политика обработки персональных данных</h1>
            <h2>1. Общие положения</h2>
            <p>Настоящая Политика обработки персональных данных определяет порядок обработки и защиты персональных данных пользователей сайта.</p>
            <p>Оператор персональных данных: ООО «ПромАвтоматика-Т», адрес: 194044, Санкт-Петербург, Пироговская наб., д.17 корп.5 лит.А, email: tech@pa.ru.</p>
            <p>Используя сайт и предоставляя свои персональные данные через формы сайта, пользователь выражает согласие на обработку персональных данных в соответствии с настоящей Политикой.</p>
            <h2>2. Какие данные мы собираем</h2>
            <p>Мы можем обрабатывать следующие персональные данные:</p>
            <ul style={{listStyle: "inside"}}>
              <li>имя;</li>
              <li>номер телефона;</li>
              <li>адрес электронной почты;</li>
              <li>IP-адрес;</li>
              <li>данные cookie;</li>
              <li>сведения о браузере, устройстве и технических характеристиках подключения;</li>
              <li>иные сведения, добровольно предоставленные пользователем.</li>
            </ul>
            <h2>3. Цели обработки персональных данных</h2>
            <p>Персональные данные обрабатываются в целях:</p>
            <ul style={{listStyle: "inside"}}>
              <li>обработки заявок пользователя;</li>
              <li>предоставления обратной связи;</li>
              <li>заключения и исполнения договоров;</li>
              <li>информирования пользователя по его запросам;</li>
              <li>улучшения качества работы сайта;</li>
              <li>анализа посещаемости и обеспечения безопасности сайта.</li>
            </ul>
            <h2>4. Правовые основания обработки</h2>
            <p>Обработка персональных данных осуществляется на основании:</p>
            <ul style={{listStyle: "inside"}}>
              <li>согласия субъекта персональных данных;</li>
              <li>исполнения договорных обязательств;</li>
              <li>требований действующего законодательства Российской Федерации.</li>
            </ul>
            <h2>5. Срок хранения персональных данных</h2>
            <p>Персональные данные хранятся не дольше, чем этого требуют цели обработки, либо в течение сроков, предусмотренных законодательством РФ.</p>
            <h2>6. Передача данных третьим лицам</h2>
            <p>Персональные данные могут передаваться лицам и организациям, обеспечивающим работу сайта и предоставление связанных сервисов (хостинг-провайдеры, почтовые сервисы, CRM-системы и иные подрядчики), при условии соблюдения требований законодательства РФ.</p>
            <h2>7. Использование cookies</h2>
            <p>Сайт может использовать файлы cookie для обеспечения корректной работы сайта, анализа посещаемости и улучшения пользовательского опыта.</p>
            <p>Продолжая использовать сайт пользователь соглашается с использованием файлов cookie</p>
            <h2>8. Защита персональных данных</h2>
            <p>Оператор принимает необходимые организационные и технические меры для защиты персональных данных от неправомерного доступа, изменения, раскрытия или уничтожения.</p>
            <h2>9. Права субъекта персональных данных</h2>
            <p>Пользователь вправе:</p>
            <ul style={{listStyle: "inside"}}>
              <li>получать сведения об обработке своих данных;</li>
              <li>требовать уточнения, блокирования или удаления данных;</li>
              <li>отзывать согласие на обработку персональных данных;</li>
              <li>обращаться по вопросам обработки данных по контактам оператора.</li>
            </ul>
            <h2>10. Контакты</h2>
            <p>По вопросам обработки персональных данных обращаться:</p>
            <Link href="mailto:tech@pa.ru">Email: tech@pa.ru</Link>
            <p>Адрес нашего офиса: <a href="https://yandex.ru/maps/-/CLwaJB0F" target="_blank">194044, Санкт-Петербург, Пироговская наб., д.17 корп.5 лит.А</a></p>
            <p>*Ответственность должностных лиц, имеющих доступ к персональным данным, за невыполнение требований норм, регулирующих обработку и защиту персональных данных, определяется в соответствии с законодательством Российской Федерации</p>
          </div>
        </div>
    </div>
  );
}