"use client";
import { fetchFSPrices, fetchLPSPrices, fetchProducts, fetchSensorsPrices, fetchStock } from "@/http/product_controll";
import {makeAutoObservable} from "mobx";

class ProductStore {

    loaded = false;
    products = [];
    LPS = [];
    FS = [];
    sensors = [];
    other = [];
    stock = [];
    lps_prices = [];
    sensors_prices = 0;
    fs_prices = [];

    searcher = [
      {
        href: "/catalog/current_prod_lps",
        name: "LPS датчики",
        description: "Преобразователь ЛП предназначен для измерения линейного перемещения промышленных объектов. Состоит из трансформаторного преобразователя ЛП LPS и БПС BDT-07. Преобразователи ЛП имеют линейную выходную характеристику.",
        short_description: "Преобразователь ЛП предназначен для измерения линейного перемещения промышленных объектов.",
        img: "/assets/images/LPS/LPS.jpg",
        characteristic: [
          "Диапазоны измерений от 7 до 660 мм",
          "Встроенный кабель или разъемный соединитель",
          "Срок службы до 100 млн. движений",
          "Двусторонний гибкий или односторонний направленный выдвижной шток",
          "Линейность до ±0,1 % диапазона",
          "Температура до 125 градусов Цельсия",
          "Степень защиты IP 67",
          "Дублированный выходной аналоговый ±10 В или 4-20 мА",
          "Возможно исполнение на заказ",
        ],
        category: "Датчики",
      },
      {
        href: "/catalog/current_prod_fs",
        name: "FS датчики",
        description: "Высокочастотные датчики частоты вращения подходят для использования с зубчатым колесом из ферромагнитного материала для генерации сигналов пропорциональной частоты вращения. Для измерения частоты вращения паровых, газовых и гидротурбин.",
        short_description: "Высокочастотные датчики частоты вращения, для измерения частоты вращения паровых, газовых и гидротурбин.",
        img: "/assets/images/FS/FS.jpg",
        characteristic: [
          "Диапазон измерений частоты вращения, от 2 до 16000 Гц",
          "Встроенный кабель или разъемный соединитель",
          "Наработка на отказ, часы, не менее 100 тыс. часов",
          "Пределы допускаемой относительной погрешности измерений частоты вращения, ±0,1 %",
          "Выходной сигнал Аналоговый или PushPull",
          "Температура до 125 градусов Цельсия",
          "Степень защиты IP 67",
          "Возможно исполнение на заказ",
        ],
        category: "Датчики",
      },
      {
        href: "/catalog/current_prod_bdt",
        name: "Блок преобразования LVDT (BDT)",
        description: "Блок БДТ-07 предназначен для обработки сигнала с преобразователя линейных перемещений серии LPS (далее, преобразователь ЛП) одновременно в токовый сигнал 4 – 20 мА и в сигнал напряжения ±10 В.",
        short_description: "Блок БДТ-07 предназначен для обработки сигнала с преобразователя линейных перемещений серии LPS (далее, преобразователь ЛП) одновременно в токовый сигнал 4 – 20 мА и в сигнал напряжения ±10 В.",
        img: "/assets/images/BDT/BDT.jpg",
        characteristic: [
          "Номинальное напряжение питания: 24В (пост.)",
          "Максимальный диапазон выходного сигнала на преобразователь ЛП: ±12В",
          "Максимальная частота выходного сигнала на преобразователь ЛП: 10кГц",
          "Максимальный выходной ток на преобразователь ЛП: 20мА",
          "Выходной ток после преобразования: 4..20мА",
          "Выходное напряжение после преобразования: ±10В",
          "Диапазон рабочих температур: 0..70 ºС",
          "Габаритные размеры (с ответными частями разъемов), Ш x В x Г: 94 x 113 x 23 мм"
        ],
        category: "Электронные блоки",
      },
      {
        href: "/catalog/current_prod_bfs",
        name: "Блок преобразования FS (BFS)",
        description: "Преобразователь сигналов измеряемых частот BFM-03L  предназначен для формирования прямоугольного сигнала из входного синусоидального сигнала.",
        short_description: "Преобразователь сигналов измеряемых частот BFM-03L  предназначен для формирования прямоугольного сигнала из входного синусоидального сигнала.",
        img: "/assets/images/BDT/BDT.jpg",
        characteristic: [
          "Амплитуда вх. синусоидального сигнала: 1..100В (перем.)",
          "Амплитуда вых. импульсного сигнала: 24В",
          "Номинальное напряжение питания: 24В",
          "Рабочая температура: 0..60 ºС",
          "Габаритные размеры Ш x В x Г: 20 х 100 х 110 мм"
        ],
        category: "Электронные блоки",
      }
    ]

    product_cards = [
    {
      name: "Датчики",
      anchor: "sens",
      products: [
        {
          href: "/catalog/current_prod_lps",
          name: "LPS датчики",
          description: "Преобразователь ЛП предназначен для измерения линейного перемещения промышленных объектов. Состоит из трансформаторного преобразователя ЛП LPS и БПС BDT-07. Преобразователи ЛП имеют линейную выходную характеристику.",
          short_description: "Преобразователь ЛП предназначен для измерения линейного перемещения промышленных объектов.",
          img: "/assets/images/LPS/LPS.png",
          characteristic: [
            "Диапазоны измерений от 7 до 660 мм",
            "Встроенный кабель или разъемный соединитель",
            "Срок службы до 100 млн. движений",
            "Двусторонний гибкий или односторонний направленный выдвижной шток",
            "Линейность до ±0,1 % диапазона",
            "Температура до 125 градусов Цельсия",
            "Степень защиты IP 67",
            "Дублированный выходной аналоговый ±10 В или 4-20 мА",
            "Возможно исполнение на заказ",
          ],
          category: "Датчики",
        },
        {
          href: "/catalog/current_prod_fs",
          name: "FS датчики",
          description: "Высокочастотные датчики частоты вращения подходят для использования с зубчатым колесом из ферромагнитного материала для генерации сигналов пропорциональной частоты вращения. Для измерения частоты вращения паровых, газовых и гидротурбин.",
          short_description: "Высокочастотные датчики частоты вращения, для измерения частоты вращения паровых, газовых и гидротурбин.",
          img: "/assets/images/FS/FS.png",
          characteristic: [
            "Диапазон измерений частоты вращения, от 2 до 16000 Гц",
            "Встроенный кабель или разъемный соединитель",
            "Наработка на отказ, часы, не менее 100 тыс. часов",
            "Пределы допускаемой относительной погрешности измерений частоты вращения, ±0,1 %",
            "Выходной сигнал Аналоговый или PushPull",
            "Температура до 125 градусов Цельсия",
            "Степень защиты IP 67",
            "Возможно исполнение на заказ",
          ],
          category: "Датчики",
        }
      ]
    },
    {
      name: "Электронные блоки",
      anchor: "blocks",
      products: [
        {
          href: "/catalog/current_prod_bdt",
          name: "Блок преобразования LVDT (BDT)",
          description: "Блок БДТ-07 предназначен для обработки сигнала с преобразователя линейных перемещений серии LPS (далее, преобразователь ЛП) одновременно в токовый сигнал 4 – 20 мА и в сигнал напряжения ±10 В.",
          short_description: "Блок БДТ-07 предназначен для обработки сигнала с преобразователя линейных перемещений серии LPS (далее, преобразователь ЛП) одновременно в токовый сигнал 4 – 20 мА и в сигнал напряжения ±10 В.",
          img: "/assets/images/BDT/BDT.jpg",
          characteristic: [
            "Номинальное напряжение питания: 24В (пост.)",
            "Максимальный диапазон выходного сигнала на преобразователь ЛП: ±12В",
            "Максимальная частота выходного сигнала на преобразователь ЛП: 10кГц",
            "Максимальный выходной ток на преобразователь ЛП: 20мА",
            "Выходной ток после преобразования: 4..20мА",
            "Выходное напряжение после преобразования: ±10В",
            "Диапазон рабочих температур: 0..70 ºС",
            "Габаритные размеры (с ответными частями разъемов), Ш x В x Г: 94 x 113 x 23 мм"
          ],
          category: "Электронные блоки",
        },
        {
          href: "/catalog/current_prod_bfs",
          name: "Блок преобразования FS (BFS)",
          description: "Преобразователь сигналов измеряемых частот BFS-01 предназначен для формирования прямоугольного сигнала из входного синусоидального сигнала.",
          short_description: "Преобразователь сигналов измеряемых частот BFS-01 предназначен для формирования прямоугольного сигнала из входного синусоидального сигнала.",
          img: "/assets/images/BFS/BFS_sl_1.jpg",
          characteristic: [
            "Амплитуда вх. синусоидального сигнала: 1..100В (перем.)",
            "Амплитуда вых. импульсного сигнала: 24В",
            "Номинальное напряжение питания: 24В",
            "Рабочая температура: 0..60 ºС",
            "Габаритные размеры Ш x В x Г: 20 х 100 х 110 мм"
          ],
          category: "Электронные блоки",
        }
      ]
    },
  ]

  reviews = [
      {
        name: "ПАО \"Юнипро\"",
        url: "/assets/reviews/Uni_pro.jpg",
      }, 
      {
        name: "ООО \"Турбосистема\"",
        url: "/assets/reviews/turbo_system.jpg",
      },
       {
        name: "ООО \"ТСА-Сервис\"",
        url: "/assets/reviews/TSA_service.jpg",
      },
       {
        name: "АО \"Жамбыльская ГРЭС\"",
        url: "/assets/reviews/GRES_Jambilskaia.jpg",
      },
       {
        name: "ООО НПФ \"Цифровые Системы Регулирования\"",
        url: "/assets/reviews/Digit_system..jpg",
      },
       {
        name: "АО \"АЛМАТИНСКИЕ ЭЛЕКТРИЧЕСКИЕ СТАНЦИИ\"",
        url: "/assets/reviews/Almata.jpg",
      },
    ]

    merquee = [
      {
        url: "/assets/images/Customers/Incontrol.svg",
        alt: "С нами работает компания Инконтрол",
        width: '300',
      },
      {
        url: "/assets/images/Customers/Jam.png",
        alt: "С нами работает компания Жамбылская грэс",
        width: "103",
      },
      {
        url: "/assets/images/Customers/Sibir.svg",
        alt: "С нами работает компания Сибирская генерирующая компания",
        width: "316",
      },
      {
        url: "/assets/images/Customers/TSA.svg",
        alt: "С нами работает компания ТСА",
        width: "298",
      },
      {
        url: "/assets/images/Customers/Turbosystem.svg",
        alt: "С нами работает компания Турбосистема",
        width: "400",
      },
      {
        url: "/assets/images/Customers/Unipro.svg",
        alt: "С нами работает компания Юнипро",
        width: "167",
      },
      {
        url: "/assets/images/Customers/InterRao.svg",
        alt: "С нами работает компания Интер РАО",
        width: "347",
      },
      {
        url: "/assets/images/Customers/BashCom.svg",
        alt: "С нами работает компания Башкирская генерирующая компания",
        width: "320",
      },
      {
        url: "/assets/images/Customers/реостат.png",
        alt: "С нами работает компания Реостат",
        width: "163",
      },
      {
        url: "/assets/images/Customers/ИНМАТЕК.png",
        alt: "С нами работает компания ИНМАТЕК",
        width: "74",
      },
      {
        url: "/assets/images/Customers/Промстрой.png",
        alt: "С нами работает компания Промстрой",
        width: "162",
      },
      {
        url: "/assets/images/Customers/техновар кс.svg",
        alt: "С нами работает компания Техновар КС",
        width: "400",
      },
      {
        url: "/assets/images/Customers/ЭМСК.png",
        alt: "С нами работает компания ЭМСК",
        width: "96",
      },
      {
        url: "/assets/images/Customers/Промавтоматика.svg",
        alt: "С нами работает компания Промавтоматика",
        width: "100",
      },
      {
        url: "/assets/images/Customers/ker_auto.svg",
        alt: "С нами работает компания КЭР автоматика",
        width: "400",
      },
      {
        url: "/assets/images/Customers/sil_mash.svg",
        alt: "С нами работает компания Силовые машины",
        width: "102",
      },

    ]
  

    current_product = null;

    constructor() {
      this.cart = [];
      this.cookie_show = true;
      makeAutoObservable(this)
    }

    async init() {

    if (this.loaded) return; // не перезапрашивать при каждом рендере
    const data = await fetchProducts();
    const st = await fetchStock();
    const l_price = await fetchLPSPrices();
    const s_price = await fetchSensorsPrices();
    const f_price = await fetchFSPrices();
    this.product = data
    this.LPS = data.LPS
    this.FS = data.FS
    this.sensors = data.sensors
    this.other = data.other
    
    this.stock = st;
    this.lps_prices = l_price;
    this.sensors_prices = s_price;
    this.fs_prices = f_price;
    this.loaded = true;
  }

  setCart(products){
    this.cart = products
  }

  setCookie(cook){
    this.cookie_show = cook
  }

  get Cookie(){
    return this.cookie_show
  }

  get Cart(){
    return this.cart
  }
}

export const productsStore = new ProductStore();