"use client";
import styles from "@/app/articles/page.module.css";
import FS from "@/components/Articles/FS";
import LVDT from "@/components/Articles/LVDT";
import LVDT_Erection from "@/components/Articles/LVDT_Erection";
import Image from "next/image";
import { useState } from "react";

export default function Articles() {

  const[active, setActive] = useState("Датчики LVDT Что это?")

  const Articles = [
    {
      name: "Датчики LVDT",
      img: "/assets/images/LPS/LPS.webp",
      head: [
        "Что это?",
        "Монтаж",
      ],
      content: [
        "Датчики LVDT – это одни из самых распространенных датчиков перемещения в инженерной и научной сферах. Они используются для измерения линейных перемещений, а также для контроля позиции и деформации объектов.",
        "LVDT – это сокращение от Linear Variable Differential Transformer, что означает линейный переменный дифференциальный трансформатор. Он работает на основе принципа электромагнитной индукции и состоит из трех обмоток, расположенных на цилиндрическом сердечнике.",
        "Когда сердечник перемещается внутри катушек, происходит изменение индуктивности каждой катушки, что приводит к изменению напряжения на выходе. Это напряжение пропорционально перемещению сердечника и может быть измерено с помощью специальных устройств.",
        "Датчики LVDT имеют множество преимуществ. Они очень точны и стабильны, имеют широкий диапазон измерений и могут работать в различных условиях окружающей среды. Кроме того, они не требуют электрического контакта с объектом, что делает их безопасными для использования во взрывоопасных зонах.",
        "Датчики LVDT широко применяются в различных областях, таких как автомобильная промышленность, медицинская техника, аэрокосмическая промышленность, производство электроники и многие другие. Они используются для измерения деформации металлических конструкций, контроля позиции и перемещения роботов, измерения давления и температуры в газовых и жидких средах и т.д.",
        "В целом, датчики LVDT являются незаменимым инструментом для многих инженерных и научных задач. Они обладают высокой точностью и надежностью, что позволяет использовать их в самых разных условиях.",  
      ],
    },
    {
      name: "Датчики FS",
      img: "/assets/images/FS/FS.webp",
      head:[
        "Что это?",
      ],
      content: [
        "Датчики частоты вращения являются важным компонентом в многих промышленных и научных приложениях. Они используются для измерения скорости вращения различных объектов, таких как двигатели, валы, роторы и турбины.",
        "Датчики частоты вращения работают на основе эффекта Холла или оптического эффекта. В случае датчиков на основе эффекта Холла, они содержат магнитный элемент и датчик Холла, который регистрирует изменение магнитного поля при вращении объекта.",
        "Оптические датчики частоты вращения используют лазерный луч и фотодетектор для измерения скорости вращения объекта. Они работают на основе изменения количества света, проходящего через специальную щель при вращении объекта.",
        "Датчики частоты вращения имеют множество преимуществ. Они обладают высокой точностью и надежностью, могут работать в широком диапазоне температур и условий окружающей среды. Кроме того, они обеспечивают быстрый отклик и могут использоваться для измерения как статических, так и динамических скоростей вращения.",
        "Датчики частоты вращения широко применяются в автомобильной промышленности, производстве электроники, аэрокосмической промышленности и других областях. Они используются для контроля скорости вращения двигателей, мониторинга работы турбин и роторов, а также для измерения скорости вращения валов и других объектов.",
        "В целом, датчики частоты вращения являются важным компонентом для контроля и мониторинга различных процессов в промышленности и науке. Они обеспечивают высокую точность и надежность измерений, что позволяет использовать их в самых разных условиях.",
      ],
    }
  ]
  
  return (
    <div className={styles.article_wrapper}>
      <div className={styles.article_container}>
        <div className={styles.article_header}><h1>Узнайте больше о мире технологий!</h1></div>
        <div className={styles.article_content}>
            {Articles.map((i, idx) => {
              return(
                <div key={"article" + idx} className={styles.article_content_main}>
                  <Image width={147} height={147} src={i.img} alt="" ></Image>
                  <div className={styles.article_content_sub}>
                    <h1>{i.name}</h1>
                    <div className={styles.article_content_sub} style={{flexDirection: "row"}}>
                    {Articles[idx].head.map((e, index) => {
                      return(
                        <button onClick={() => setActive(i.name + " " + e)} key={"article" + idx + index} className={`${styles.article_content_sub_btn} ${active === i.name + " " + e && styles.article_content_sub_btn_active}`}>{e}</button>
                      )
                    })}
                    </div>
                  </div>
                </div>
              )
            })}
            {active === "Датчики LVDT Что это?" &&
              <LVDT/>
            }
            {active === "Датчики LVDT Монтаж" &&
              <LVDT_Erection/>
            }
            {active === "Датчики FS Что это?" &&
              <FS/>
            }
        </div>
      </div>
    </div>
  );
}