"use client";
import styles from "@/app/privacy_policy/page.module.css";
import Link from "next/link";


export default function Privacy() {
   

  
  return (
    <div className={styles.contacts_wrapper}>
        <div className={styles.contacts_container}>
          <div className={styles.contacts_header}>
            <h1>Политика конфиденциальности</h1>
            <h2>1. Общие положения</h2>
            <p>Настоящая Политика конфиденциальности определяет порядок использования, обработки и защиты информации, получаемой от пользователей сайта.
            Использование сайта и заполнение форм обратной связи означает ознакомление пользователя с настоящей Политикой и согласие с условиями обработки персональных данных.</p>
            <h2>2. Какие данные могут собираться</h2>
            <p>При использовании сайта могут собираться следующие данные:</p>
            <ul style={{listStyle: "inside"}}>
              <li>имя;</li>
              <li>номер телефона;</li>
              <li>адрес электронной почты;</li>
              <li>IP-адрес;</li>
              <li>данные файлов cookie;</li>
              <li>сведения о браузере, устройстве и технические данные о посещении сайта.</li>
            </ul>
            <h2>3. Цели использования информации</h2>
            <p>Информация используется для:</p>
            <ul style={{listStyle: "inside"}}>
              <li>обработки заявок и обращений пользователей;</li>
              <li>предоставления обратной связи;</li>
              <li>улучшения работы сайта;</li>
              <li>анализа посещаемости;</li>
              <li>обеспечения безопасности сайта.</li>
            </ul>
            <h2>4. Конфиденциальность и защита информации</h2>
            <p>Оператор принимает необходимые организационные и технические меры для защиты информации пользователей от неправомерного доступа, изменения, раскрытия или уничтожения.</p>
            <h2>5. Передача информации третьим лицам</h2>
            <p>Информация может передаваться сервисам и подрядчикам, обеспечивающим функционирование сайта, обработку обращений и техническую поддержку, только в объеме, необходимом для достижения целей обработки.</p>
            <h2>6. Использование файлов cookie</h2>
            <p>Сайт может использовать файлы cookie для корректной работы сайта и анализа пользовательской активности.</p>
            <p>Пользователь вправе изменить настройки использования cookie через настройки браузера.</p>
            <h2>7. Контакты</h2>
            <p>По вопросам, связанным с обработкой данных:</p>
            <Link href="mailto:tech@pa.ru">Email: tech@pa.ru</Link>
          </div>
        </div>
    </div>
  );
}